#1. Interface.hs: No file
agda2atp /tmp/NoFile.agda
<<<
>>>
>>>2
agda2atp: The file /tmp/NoFile.agda does not exist
>>>= 1

#2. RemoveProofTerms.hs : Don't erase a proof term
agda2atp -itest/errors test/errors/NotErasedProofTerm.agda
<<<
>>>
>>>2
agda2atp: The translation failed because we do not know how erase the term
Pi r(El {getSort = Type (Max []), unEl = Def NotErasedProofTerm.D []}) (Abs "k" El {getSort = Type (Max []), unEl = Def NotErasedProofTerm._â‰¤_ [r(Var 0 []),r(Var 0 [])]})
>>>= 1

#3. Terms.hs: Required pragma --universal-quantified-formulas
agda2atp -itest/errors test/errors/PragmaRequired1.agda
<<<
>>>
>>>2
agda2atp: Use Agda option `--universal-quantified-formulas' for the translation of first-order logic universal quantified formulas
>>>= 1

#4. Terms.hs: Required pragma --universal-quantified-propositional-functions
agda2atp -itest/errors test/errors/PragmaRequired2.agda
<<<
>>>
>>>2
agda2atp: Use Agda option `--universal-quantified-propositional-functions' for the translation of first-order logic universal quantified propositional functions
>>>= 1

#5. Terms.hs: Required pragma --universal-quantified-functions
agda2atp -itest/errors test/errors/PragmaRequired3.agda
<<<
>>>
>>>2
agda2atp: Use Agda option `--universal-quantified-functions' for the translation of first-order logic universal quantified functions
>>>= 1

#6. RemoveProofTerms.hs: Underscore variables
agda2atp -itest/errors test/errors/Underscore.agda
<<<
>>>
>>>2
agda2atp: The translation of underscore variables is not implemented
>>>= 1

#7. Options.hs: Only process one input file
agda2atp File1.agda File2.agda
<<<
>>>
>>>2
agda2atp: Only one input file allowed
>>>= 1

#8. Unrecognized option
agda2atp --xxx
<<<
>>>
>>>2
agda2atp: unrecognized option `--xxx'
>>>= 1

#9. Main.hs: Missing input file
agda2atp
<<<
>>>
>>>2
agda2atp: Missing input file (try --help)
>>>= 1

#10. Snapshot.hs: The --output-dir cannot be the same than the --snapshot-dir
agda2atp -itest/errors --output-dir=/tmp --snapshot-test --snapshot-dir=/tmp test/errors/TrivialTheorem.agda
<<<
>>>
>>>2
agda2atp: The options `--output-dir' and `--snapshot-dir' cannot be the same
>>>= 1

#11. Snapshot.hs: Missing snapshot file
agda2atp -itest/errors --snapshot-test --snapshot-dir=no-dir test/errors/TrivialTheorem.agda
<<<
>>>
>>>2
agda2atp: The file no-dir/TrivialTheorem/18-foo.tptp does not exist
>>>= 1

#12. ATP.hs: ATP unknown
agda2atp -itest/errors --atp=xxx test/errors/TrivialTheorem.agda
<<<
>>>
Proving the conjecture in /tmp/TrivialTheorem/18-foo.tptp ...
>>>2
agda2atp: ATP xxx unknown
>>>= 1

#13. ATP.hs: Bad ATP executable name
agda2atp -itest/errors --vampire-exec=xxx test/errors/TrivialTheorem.agda
<<<
>>>
Proving the conjecture in /tmp/TrivialTheorem/18-foo.tptp ...
>>>2
agda2atp: The command xxx associated with Vampire does not exist.
You can use the command-line option --atp=NAME to avoid call the defaults ATPs
>>>= 1

#14. ATP.hs: No theorem
agda2atp -itest/errors --atp=e test/errors/NoTheorem.agda
<<<
>>>
Proving the conjecture in /tmp/NoTheorem/15-foo.tptp ...
E 1.6 Tiger Hill *did not* prove the conjecture
>>>2
agda2atp: The ATP(s) did not prove the conjecture in /tmp/NoTheorem/15-foo.tptp
>>>= 1

#15. Functions.hs : The definitions to be translated only can have one clause
agda2atp -itest/errors test/errors/OnlyOneClause.agda
<<<
>>>
>>>2
agda2atp: The translation of OnlyOneClause._+_ failed because its definition only can have a clause
>>>= 1

#16. Interface.hs: Missing interface file
echo -e "module A where" > /tmp/A.agda && agda2atp /tmp/A.agda
<<<
>>>
>>>2
agda2atp: The interface file /tmp/A.agdai does not exist. Use Agda to generate it
>>>= 1

#17. Snapshot.hs: The snapshot and the generated conjecture are differents.
agda2atp -itest/errors --only-files --output-dir=/tmp/snapshot test/errors/TrivialTheorem.agda && sed -i '$ d' /tmp/snapshot/TrivialTheorem/18-foo.tptp && agda2atp -itest/errors --snapshot-test --snapshot-dir=/tmp/snapshot test/errors/TrivialTheorem.agda
<<<
>>>
Created /tmp/snapshot/TrivialTheorem/18-foo.tptp
>>>2
agda2atp: The files are different:
/tmp/TrivialTheorem/18-foo.tptp
/tmp/snapshot/TrivialTheorem/18-foo.tptp
>>>= 1

#18. Options.hs (System.Console.GetOpt): -i
agda2atp -i
<<<
>>>
>>>2
agda2atp: option `-i' requires an argument DIR
>>>= 1

#19. Options.hs (System.Console.GetOpt): --agda-include-path
agda2atp --agda-include-path
<<<
>>>
>>>2
agda2atp: option `--agda-include-path' requires an argument DIR
>>>= 1

#20. Options.hs: --agda-include-path=
agda2atp --agda-include-path=
<<<
>>>
>>>2
agda2atp: Option `--agda-include-path' requires an argument DIR
>>>= 1

#21. Options.hs (System.Console.GetOpt): --atp
agda2atp --atp
<<<
>>>
>>>2
agda2atp: option `--atp' requires an argument NAME
>>>= 1

#22. Options.hs: --atp=
agda2atp --atp=
<<<
>>>
>>>2
agda2atp: Option `--atp' requires an argument NAME
>>>= 1

#23. Options.hs (System.Console.GetOpt): --output-dir
agda2atp --output-dir
<<<
>>>
>>>2
agda2atp: option `--output-dir' requires an argument DIR
>>>= 1

#24. Options.hs: --output-dir=
agda2atp --output-dir=
<<<
>>>
>>>2
agda2atp: Option `--output-dir' requires an argument DIR
>>>= 1

#25. Options.hs (System.Console.GetOpt): --snapshot-dir
agda2atp --snapshot-dir
<<<
>>>
>>>2
agda2atp: option `--snapshot-dir' requires an argument DIR
>>>= 1

#26. Options.hs: --snapshot-dir=
agda2atp --snapshot-dir=
<<<
>>>
>>>2
agda2atp: Option `--snapshot-dir' requires an argument DIR
>>>= 1

#27. Options.hs (System.Console.GetOpt): --time
agda2atp --time
<<<
>>>
>>>2
agda2atp: option `--time' requires an argument NUM
>>>= 1

#28. Options.hs: --time=
agda2atp --time=
<<<
>>>
>>>2
agda2atp: Option `--time' requires an argument NUM
>>>= 1

#29. Options.hs: --time=negative_value
agda2atp --time=-10
<<<
>>>
>>>2
agda2atp: Option `--time' requires a non-negative integer argument
>>>= 1

#30. Options.hs (System.Console.GetOpt): --vampire-exec
agda2atp --vampire-exec
<<<
>>>
>>>2
agda2atp: option `--vampire-exec' requires an argument COMMAND
>>>= 1

#31. Options.hs: --vampire-exec=
agda2atp --vampire-exec=
<<<
>>>
>>>2
agda2atp: Option `--vampire-exec' requires an argument COMMAND
>>>= 1

#32. Options.hs (System.Console.GetOpt): -v
agda2atp -v
<<<
>>>
>>>2
agda2atp: option `-v' requires an argument N
>>>= 1

#33. Options.hs (System.Console.GetOpt): --verbose
agda2atp --verbose
<<<
>>>
>>>2
agda2atp: option `--verbose' requires an argument N
>>>= 1

#34. Options.hs: --verbose=
agda2atp --verbose=
<<<
>>>
>>>2
agda2atp: Option `--verbose' requires an argument of the form x.y.z:N or N
>>>= 1
